cf_billing/Documents/энргСоглашениеПоРассрочке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСоглашениеПоРассрочке</Name>
			<BasedOn>
				<xr:Item>Task.энргЗадачаПИД</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобытия</xr:Item>
				<xr:Item>InformationRegister.энргРеструктуризацияДолга</xr:Item>
				<xr:Item>AccumulationRegister.энргЗабалансоваяЗадолженность</xr:Item>
				<xr:Item>InformationRegister.энргДокументыРеструктуризации</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяДатаПогашенияЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКРаспределению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПогашенияЗадолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекущиеЗадолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргБанкротство</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРегистрацияРазовыхНачислений</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеНаПрочиеУслуги</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
								<v8:Type>cfg:DocumentRef.энргЗагрузкаДанныхИзВнешнихСистем</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеДляЛьготныхЛиц</v8:Type>
								<v8:Type>cfg:DocumentRef.энргАктБездоговорногоПотребления</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПереносОплаты</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргЗабалансоваяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргЗабалансоваяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоПени</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Documents/энргСоглашениеПоРассрочке/Forms/ФормаДокументаФЛ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
 	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Объект.Абонент) Тогда
			ДанныеАбонента  		= Новый Структура("Район,Организация,Строение,Помещение");			
			ДанныеАбонента.удалить("Абонент");
			энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеАбонента);
			ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ДанныеАбонента,"Район,Организация,Строение");
		КонецЕсли;	
		РасчитатьЗадолженностьНаСервере();
	КонецЕсли;	
	
 	ОбновитьСуммуОплатНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСуммуОплатНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуОплат(Команда)
	ОбновитьСуммуОплатНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьЗадолженность(Команда)
	РасчитатьЗадолженностьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементыФормы
&НаКлиенте
Процедура ПланПогашенияЗадолженностиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Объект.ПланПогашенияЗадолженности.Сортировать("Дата Возр");
	ОбновитьСуммуОплатНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПланПогашенияЗадолженностиДатаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПланПогашенияЗадолженности.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.Дата < Объект.Дата Тогда
		ТекСтрока.Дата = Объект.Дата;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата плановой выплаты не может быть раньше даты задачи.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланПогашенияЗадолженностиПередУдалением(Элемент, Отказ)
	ОбновитьСуммуОплатНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Объект.Организация	= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Абонент, "Организация");
	Объект.Район		= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Абонент, "Район");
	Объект.Строение 	= ПолучитьСтроениеАбонента(Объект.Абонент);
	
	РасчитатьЗадолженностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеЗадолженностиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеЗадолженностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеЗадолженностиОтметкаПриИзменении(Элемент)
	Объект.СуммаКРаспределению = 0;
	Для каждого Строка Из Объект.ТекущиеЗадолженности Цикл
		Если НЕ Строка.Отметка Тогда
			Продолжить;
		КонецЕсли;
		Объект.СуммаКРаспределению = Объект.СуммаКРаспределению + Строка.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	РасчитатьЗадолженностьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьСуммуОплатНаСервере()

	Если Не ЗначениеЗаполнено(Объект.ПланПогашенияЗадолженности) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПланПогашенияЗадолженности.Сортировать("Дата");
	ДатаОкон = КонецДня(Объект.ПланПогашенияЗадолженности[Объект.ПланПогашенияЗадолженности.Количество()-1].Дата);
	
	Для каждого Строка Из Объект.ПланПогашенияЗадолженности Цикл
		Строка.СуммаУплачено = 0;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИсточник.Услуга КАК Услуга,
		|	ТаблицаИсточник.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаИсточник.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ТаблицаИсточник
		|ИЗ
		|	&ТаблицаИсточник КАК ТаблицаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(энргЗабалансоваяЗадолженностьОбороты.Период, ДЕНЬ) КАК Период,
		|	СУММА(энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиРасход) КАК СуммаВыплат
		|ИЗ
		|	РегистрНакопления.энргЗабалансоваяЗадолженность.Обороты(
		|			&ДатаНач,
		|			&ДатаОкон,
		|			Регистратор,
		|			(Организация, Район, Абонент, Услуга, ПериодНачисления) В
		|					(ВЫБРАТЬ
		|						&Организация КАК Организация,
		|						&Район КАК Район,
		|						&Абонент КАК Абонент,
		|						ТаблицаИсточник.Услуга КАК Услуга,
		|						ТаблицаИсточник.ПериодНачисления КАК ПериодНачисления
		|					ИЗ
		|						ТаблицаИсточник КАК ТаблицаИсточник)
		|				И ВидЗадолженности = &ВидЗадолженности) КАК энргЗабалансоваяЗадолженностьОбороты
		|ГДЕ
		|	НЕ энргЗабалансоваяЗадолженностьОбороты.Регистратор ССЫЛКА Документ.энргБанкротство
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(энргЗабалансоваяЗадолженностьОбороты.Период, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Строение", Объект.Строение);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	Запрос.УстановитьПараметр("ДатаНач", Объект.Дата);
	Запрос.УстановитьПараметр("ДатаОкон", ДатаОкон);
	Запрос.УстановитьПараметр("ВидЗадолженности", Перечисления.энргВидыЗадолженности.РеструктуризированнаяЗадолженность);
	Запрос.УстановитьПараметр("ТаблицаИсточник", Объект.ТекущиеЗадолженности.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	//СуммаВыплат = Неопределено;
	//Если Выборка.Следующий() Тогда 
	//	СуммаВыплат = Выборка.СуммаВыплат;
	//КонецЕсли;
	//СуммаВыплат = ?(ЗначениеЗаполнено(СуммаВыплат), СуммаВыплат, 0);
	//
	//Для каждого СтрокаТЧ Из Объект.ПланПогашенияЗадолженности Цикл
	//	Если СтрокаТЧ.Сумма > СуммаВыплат Тогда
	//		СтрокаТЧ.СуммаУплачено = СуммаВыплат;
	//		СуммаВыплат = 0;
	//	Иначе
	//		СтрокаТЧ.СуммаУплачено = СтрокаТЧ.Сумма;
	//		СуммаВыплат = СуммаВыплат - СтрокаТЧ.Сумма;
	//	КонецЕсли;
	//КонецЦикла;
	
	ДатаДокумента = НачалоДня(Объект.Дата) - 1;	
	Пока Выборка.Следующий() Цикл
		
		ЭтоПерваяСтрока = Истина;
		ПредыдущаяДата = ДатаДокумента;
		Для каждого Строка Из Объект.ПланПогашенияЗадолженности Цикл
			
			Если Выборка.Период > ?(ЭтоПерваяСтрока, ДатаДокумента, ПредыдущаяДата) И Выборка.Период <= Строка.Дата Тогда
				Строка.СуммаУплачено = Строка.СуммаУплачено + Выборка.СуммаВыплат;
				Прервать;
			КонецЕсли;
			
			ПредыдущаяДата = Строка.Дата;
			ЭтоПерваяСтрока = Ложь;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьЗадолженностьНаСервере()
	//Задачи.энргЗадачаПИД.ЗаполнитьЗадолженностьЗадачи(Объект);
	
	Объект.СуммаЗадолженности = 0;
	Объект.СуммаКРаспределению = 0;
	Объект.СуммаПени = 0; 
	
	Объект.ПланПогашенияЗадолженности.Очистить();
	Объект.ТекущиеЗадолженности.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток - ЕСТЬNULL(энргВзаиморасчетыПоМесяцамОбороты.СуммаПриход, 0) КАК Задолженность,
		|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
		|	0 КАК СуммаПени
		|ПОМЕСТИТЬ ВТ_Задолженность
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент
		|				И МКД = &МКД) КАК энргВзаиморасчетыПоМесяцамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(
		|				&НачалоНеПрос,
		|				&ТекДата,
		|				,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Абонент = &Абонент
		|					И МКД = &МКД) КАК энргВзаиморасчетыПоМесяцамОбороты
		|		ПО энргВзаиморасчетыПоМесяцамОстатки.Организация = энргВзаиморасчетыПоМесяцамОбороты.Организация
		|			И энргВзаиморасчетыПоМесяцамОстатки.Район = энргВзаиморасчетыПоМесяцамОбороты.Район
		|			И энргВзаиморасчетыПоМесяцамОстатки.МКД = энргВзаиморасчетыПоМесяцамОбороты.МКД
		|			И энргВзаиморасчетыПоМесяцамОстатки.Абонент = энргВзаиморасчетыПоМесяцамОбороты.Абонент
		|			И энргВзаиморасчетыПоМесяцамОстатки.Услуга = энргВзаиморасчетыПоМесяцамОбороты.Услуга
		|			И энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления = энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления
		|ГДЕ
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток - ЕСТЬNULL(энргВзаиморасчетыПоМесяцамОбороты.СуммаПриход, 0) >= 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоПениОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыПоПениОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоПениОстатки.МКД КАК МКД,
		|	энргВзаиморасчетыПоПениОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоПениОстатки.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления КАК ПериодНачисления,
		|	ЕСТЬNULL(энргВзаиморасчетыПоПениОстатки.СуммаОстаток, 0) КАК СуммаПени
		|ПОМЕСТИТЬ ВТ_ЗадолженностьПоПени
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент
		|				И МКД = &МКД) КАК энргВзаиморасчетыПоПениОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоПени.Обороты(
		|				&НачалоНеПрос,
		|				&ТекДата,
		|				,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Абонент = &Абонент
		|					И МКД = &МКД) КАК энргВзаиморасчетыПоПениОбороты
		|		ПО энргВзаиморасчетыПоПениОстатки.Организация = энргВзаиморасчетыПоПениОбороты.Организация
		|			И энргВзаиморасчетыПоПениОстатки.Район = энргВзаиморасчетыПоПениОбороты.Район
		|			И энргВзаиморасчетыПоПениОстатки.МКД = энргВзаиморасчетыПоПениОбороты.МКД
		|			И энргВзаиморасчетыПоПениОстатки.Абонент = энргВзаиморасчетыПоПениОбороты.Абонент
		|			И энргВзаиморасчетыПоПениОстатки.Услуга = энргВзаиморасчетыПоПениОбороты.Услуга
		|			И энргВзаиморасчетыПоПениОстатки.ПериодНачисления = энргВзаиморасчетыПоПениОбороты.ПериодНачисления
		|ГДЕ
		|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток - ЕСТЬNULL(энргВзаиморасчетыПоПениОбороты.СуммаПриход, 0) >= 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОбороты.Организация КАК Организация,
		|	энргВзаиморасчетыПоМесяцамОбороты.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОбороты.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОбороты.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(ВЫБОР
		|			КОГДА энргВзаиморасчетыПоМесяцамОбороты.СуммаРасход < 0
		|				ТОГДА -энргВзаиморасчетыПоМесяцамОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ + энргВзаиморасчетыПоМесяцамОбороты.СуммаПриход) КАК ТребуемаяПлата,
		|	энргВзаиморасчетыПоМесяцамОбороты.Регистратор КАК Регистратор,
		|	энргВзаиморасчетыПоМесяцамОбороты.Регистратор.МоментВремени КАК МоментВремени,
		|	МАКСИМУМ(энргВзаиморасчетыПоМесяцамОбороты.Период) КАК Период,
		|	энргВзаиморасчетыПоМесяцамОбороты.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ВсеНачисления
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(
		|			,
		|			&Граница,
		|			Регистратор,
		|			(Организация, Район, МКД, Абонент, Услуга, ПериодНачисления) В
		|				(ВЫБРАТЬ
		|					ВТ_Задолженность.Организация КАК Организация,
		|					ВТ_Задолженность.Район КАК Район,
		|					ВТ_Задолженность.МКД КАК МКД,
		|					ВТ_Задолженность.Абонент КАК Абонент,
		|					ВТ_Задолженность.Услуга КАК Услуга,
		|					ВТ_Задолженность.ПериодНачисления КАК ПериодНачисления
		|				ИЗ
		|					ВТ_Задолженность КАК ВТ_Задолженность)) КАК энргВзаиморасчетыПоМесяцамОбороты
		|ГДЕ
		|	(энргВзаиморасчетыПоМесяцамОбороты.СуммаРасход < 0
		|			ИЛИ энргВзаиморасчетыПоМесяцамОбороты.СуммаПриход <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОбороты.Организация,
		|	энргВзаиморасчетыПоМесяцамОбороты.Район,
		|	энргВзаиморасчетыПоМесяцамОбороты.Абонент,
		|	энргВзаиморасчетыПоМесяцамОбороты.Регистратор,
		|	энргВзаиморасчетыПоМесяцамОбороты.Регистратор.МоментВремени,
		|	энргВзаиморасчетыПоМесяцамОбороты.Услуга,
		|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОбороты.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНачисления.Организация КАК Организация,
		|	ВТ_ВсеНачисления.Район КАК Район,
		|	ВТ_ВсеНачисления.Абонент КАК Абонент,
		|	ВТ_ВсеНачисления.Регистратор КАК Регистратор,
		|	СУММА(ВТ_ВсеНачисления1.ТребуемаяПлата) КАК ТребуемаяПлата,
		|	ВТ_ВсеНачисления.МоментВремени КАК МоментВремени,
		|	ВТ_ВсеНачисления.Услуга КАК Услуга,
		|	ВТ_ВсеНачисления.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ВсеНачисления.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_НакопленныеНачисления
		|ИЗ
		|	ВТ_ВсеНачисления КАК ВТ_ВсеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеНачисления КАК ВТ_ВсеНачисления1
		|		ПО ВТ_ВсеНачисления.Организация = ВТ_ВсеНачисления1.Организация
		|			И ВТ_ВсеНачисления.Район = ВТ_ВсеНачисления1.Район
		|			И ВТ_ВсеНачисления.Абонент = ВТ_ВсеНачисления1.Абонент
		|			И ВТ_ВсеНачисления.МоментВремени <= ВТ_ВсеНачисления1.МоментВремени
		|			И ВТ_ВсеНачисления.Услуга = ВТ_ВсеНачисления1.Услуга
		|			И ВТ_ВсеНачисления.ПериодНачисления = ВТ_ВсеНачисления1.ПериодНачисления
		|			И ВТ_ВсеНачисления.Поставщик = ВТ_ВсеНачисления1.Поставщик
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеНачисления.Организация,
		|	ВТ_ВсеНачисления.Абонент,
		|	ВТ_ВсеНачисления.Район,
		|	ВТ_ВсеНачисления.Регистратор,
		|	ВТ_ВсеНачисления.МоментВремени,
		|	ВТ_ВсеНачисления.Услуга,
		|	ВТ_ВсеНачисления.ПериодНачисления,
		|	ВТ_ВсеНачисления.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НакопленныеНачисления.Организация КАК Организация,
		|	ВТ_НакопленныеНачисления.Район КАК Район,
		|	ВТ_НакопленныеНачисления.Абонент КАК Абонент,
		|	ВТ_НакопленныеНачисления.Регистратор КАК Регистратор,
		|	ВТ_НакопленныеНачисления.ТребуемаяПлата КАК ТребуемаяПлата,
		|	ВТ_НакопленныеНачисления.МоментВремени КАК МоментВремени,
		|	ВТ_НакопленныеНачисления.ТребуемаяПлата - ВТ_Задолженность.Задолженность КАК Корректировка,
		|	ВТ_НакопленныеНачисления.Услуга КАК Услуга,
		|	ВТ_НакопленныеНачисления.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_НакопленныеНачисления.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ЛишниеРегистраторыИПоследняяЗапись
		|ИЗ
		|	ВТ_НакопленныеНачисления КАК ВТ_НакопленныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задолженность КАК ВТ_Задолженность
		|		ПО ВТ_НакопленныеНачисления.Организация = ВТ_Задолженность.Организация
		|			И ВТ_НакопленныеНачисления.Район = ВТ_Задолженность.Район
		|			И ВТ_НакопленныеНачисления.Абонент = ВТ_Задолженность.Абонент
		|			И ВТ_НакопленныеНачисления.ТребуемаяПлата >= ВТ_Задолженность.Задолженность
		|			И ВТ_НакопленныеНачисления.Услуга = ВТ_Задолженность.Услуга
		|			И ВТ_НакопленныеНачисления.ПериодНачисления = ВТ_Задолженность.ПериодНачисления
		|			И ВТ_НакопленныеНачисления.Поставщик = ВТ_Задолженность.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Организация КАК Организация,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Район КАК Район,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Абонент КАК Абонент,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Регистратор КАК Регистратор,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Регистратор) КАК КолРегистраторовДо,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Корректировка КАК Корректировка,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.МоментВремени КАК МоментВремени,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Услуга КАК Услуга,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ВТ_ПоследняяЗапись
		|ИЗ
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись КАК ВТ_ЛишниеРегистраторыИПоследняяЗапись
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛишниеРегистраторыИПоследняяЗапись КАК ВТ_ЛишниеРегистраторыИПоследняяЗапись1
		|		ПО ВТ_ЛишниеРегистраторыИПоследняяЗапись.Организация = ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Организация
		|			И ВТ_ЛишниеРегистраторыИПоследняяЗапись.Район = ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Район
		|			И ВТ_ЛишниеРегистраторыИПоследняяЗапись.Абонент = ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Абонент
		|			И ВТ_ЛишниеРегистраторыИПоследняяЗапись.МоментВремени < ВТ_ЛишниеРегистраторыИПоследняяЗапись1.МоментВремени
		|			И ВТ_ЛишниеРегистраторыИПоследняяЗапись.Услуга = ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Услуга
		|			И ВТ_ЛишниеРегистраторыИПоследняяЗапись.ПериодНачисления = ВТ_ЛишниеРегистраторыИПоследняяЗапись1.ПериодНачисления
		|			И ВТ_ЛишниеРегистраторыИПоследняяЗапись.Поставщик = ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Поставщик
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Организация,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Район,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Абонент,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Регистратор,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Корректировка,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.МоментВремени,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Услуга,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.ПериодНачисления,
		|	ВТ_ЛишниеРегистраторыИПоследняяЗапись.Поставщик
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЛишниеРегистраторыИПоследняяЗапись1.Регистратор) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНачисления.Регистратор КАК Документ,
		|	ВЫБОР
		|		КОГДА ВТ_ПоследняяЗапись.Регистратор = ВТ_ВсеНачисления.Регистратор
		|			ТОГДА ВТ_ВсеНачисления.ТребуемаяПлата - ВТ_ПоследняяЗапись.Корректировка
		|		ИНАЧЕ ВТ_ВсеНачисления.ТребуемаяПлата
		|	КОНЕЦ КАК Сумма,
		|	ВТ_ВсеНачисления.Услуга КАК Услуга,
		|	ВТ_ВсеНачисления.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ВсеНачисления.Поставщик КАК Поставщик
		|ПОМЕСТИТЬ ИтоговыеДанные
		|ИЗ
		|	ВТ_ВсеНачисления КАК ВТ_ВсеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследняяЗапись КАК ВТ_ПоследняяЗапись
		|		ПО ВТ_ВсеНачисления.Организация = ВТ_ПоследняяЗапись.Организация
		|			И ВТ_ВсеНачисления.Район = ВТ_ПоследняяЗапись.Район
		|			И ВТ_ВсеНачисления.Абонент = ВТ_ПоследняяЗапись.Абонент
		|			И ВТ_ВсеНачисления.МоментВремени >= ВТ_ПоследняяЗапись.МоментВремени
		|			И ВТ_ВсеНачисления.Услуга = ВТ_ПоследняяЗапись.Услуга
		|			И ВТ_ВсеНачисления.ПериодНачисления = ВТ_ПоследняяЗапись.ПериодНачисления
		|			И ВТ_ВсеНачисления.Поставщик = ВТ_ПоследняяЗапись.Поставщик
		|ГДЕ
		|	(НЕ 1 В
		|					(ВЫБРАТЬ
		|						КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПоследняяЗапись.Регистратор) КАК Регистратор
		|					ИЗ
		|						ВТ_ПоследняяЗапись КАК ВТ_ПоследняяЗапись)
		|			ИЛИ НЕ ВТ_ПоследняяЗапись.Регистратор ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргРеструктуризацияДолгаСрезПоследних.Организация КАК Организация,
		|	энргРеструктуризацияДолгаСрезПоследних.Район КАК Район,
		|	энргРеструктуризацияДолгаСрезПоследних.Строение КАК Строение,
		|	энргРеструктуризацияДолгаСрезПоследних.Абонент КАК Абонент,
		|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	энргРеструктуризацияДолгаСрезПоследних.Документ КАК Документ,
		|	СУММА(ВЫБОР
		|			КОГДА энргВзаиморасчеты.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА энргВзаиморасчеты.Сумма
		|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И энргВзаиморасчеты.Сумма < 0
		|				ТОГДА -энргВзаиморасчеты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
		|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая КАК СуммаОбщая
		|ПОМЕСТИТЬ Реструктуризация
		|ИЗ
		|	РегистрСведений.энргРеструктуризацияДолга.СрезПоследних(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Строение = &МКД
		|				И Абонент = &Абонент
		|				И НЕ Документ = &Документ
		|				И ДатаОплаты <= &ТекДата) КАК энргРеструктуризацияДолгаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
		|		ПО энргРеструктуризацияДолгаСрезПоследних.Организация = энргВзаиморасчеты.Организация
		|			И энргРеструктуризацияДолгаСрезПоследних.Район = энргВзаиморасчеты.Район
		|			И энргРеструктуризацияДолгаСрезПоследних.Строение = энргВзаиморасчеты.МКД
		|			И энргРеструктуризацияДолгаСрезПоследних.Абонент = энргВзаиморасчеты.Абонент
		|			И энргРеструктуризацияДолгаСрезПоследних.ДатаНачала <= энргВзаиморасчеты.Период
		|			И энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты >= энргВзаиморасчеты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	энргРеструктуризацияДолгаСрезПоследних.Организация,
		|	энргРеструктуризацияДолгаСрезПоследних.Район,
		|	энргРеструктуризацияДолгаСрезПоследних.Строение,
		|	энргРеструктуризацияДолгаСрезПоследних.Абонент,
		|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты,
		|	энргРеструктуризацияДолгаСрезПоследних.Документ,
		|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом,
		|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реструктуризация.Документ КАК Документ,
		|	Реструктуризация.СуммаОбщая КАК СуммаОбщая,
		|	МИНИМУМ(Реструктуризация.Сумма >= Реструктуризация.СуммаНарастающимИтогом) КАК ОтметкаВыполненного
		|ПОМЕСТИТЬ ВыполненныеРеструктуризации
		|ИЗ
		|	Реструктуризация КАК Реструктуризация
		|
		|СГРУППИРОВАТЬ ПО
		|	Реструктуризация.Документ,
		|	Реструктуризация.СуммаОбщая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргДокументыРеструктуризации.ДокументРасходов КАК Ссылка
		|ПОМЕСТИТЬ ДокументыИсключения
		|ИЗ
		|	РегистрСведений.энргДокументыРеструктуризации КАК энргДокументыРеструктуризации
		|ГДЕ
		|	энргДокументыРеструктуризации.ДокументРеструктуризации В
		|			(ВЫБРАТЬ
		|				ВыполненныеРеструктуризации.Документ
		|			ИЗ
		|				ВыполненныеРеструктуризации КАК ВыполненныеРеструктуризации
		|			ГДЕ
		|				ВыполненныеРеструктуризации.ОтметкаВыполненного)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговыеДанные.Документ КАК Документ,
		|	ИтоговыеДанные.Сумма КАК Сумма,
		|	ИтоговыеДанные.Услуга КАК Услуга,
		|	ИтоговыеДанные.ПериодНачисления КАК ПериодНачисления,
		|	ИтоговыеДанные.Поставщик КАК Поставщик,
		|	ЕСТЬNULL(ВТ_ЗадолженностьПоПени.СуммаПени, 0) КАК СуммаПени,
		|	ИСТИНА КАК Отметка
		|ИЗ
		|	ИтоговыеДанные КАК ИтоговыеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностьПоПени КАК ВТ_ЗадолженностьПоПени
		|		ПО ИтоговыеДанные.Услуга = ВТ_ЗадолженностьПоПени.Услуга
		|			И ИтоговыеДанные.ПериодНачисления = ВТ_ЗадолженностьПоПени.ПериодНачисления
		|ГДЕ
		|	НЕ ИтоговыеДанные.Документ В
		|				(ВЫБРАТЬ
		|					ДокументыИсключения.Ссылка
		|				ИЗ
		|					ДокументыИсключения КАК ДокументыИсключения)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодНачисления";
	
	ДатаЗадачи = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	Граница = Задачи.энргЗадачаПИД.ПолучитьГраницуПросрочки(ДатаЗадачи, Объект.Организация, Объект.Район, Объект.Абонент); 
	Запрос.УстановитьПараметр("Абонент",	 Объект.Абонент);
	Запрос.УстановитьПараметр("Граница",	 Граница);
	Запрос.УстановитьПараметр("НачалоНеПрос",Граница+1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район",		 Объект.Район);
	Запрос.УстановитьПараметр("ТекДата",	 ДатаЗадачи);
	Запрос.УстановитьПараметр("Документ",	 Объект.Ссылка);
	Запрос.УстановитьПараметр("МКД",	 	 Объект.Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.СуммаЗадолженности = Объект.СуммаЗадолженности + Выборка.Сумма;
		Объект.СуммаПени = Объект.СуммаПени + Выборка.СуммаПени; 
		ЗаполнитьЗначенияСвойств(Объект.ТекущиеЗадолженности.Добавить(), Выборка); 
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтроениеАбонента(Абонент)
	
	Строение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.КлючПомещения = &КлючПомещения
		|	И энргКлючиПомещений.Строение.ТипСтроения = ЗНАЧЕНИЕ(Перечисление.энргТипыСтроений.МКД)";
	
	Запрос.УстановитьПараметр("КлючПомещения", Абонент.КлючПомещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Строение = ВыборкаДетальныеЗаписи.Строение;
	КонецЕсли;
	
	Возврат Строение;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступность()
	
	ЭтоЗакрытие = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ"));
	
	ТолькоПросмотр = ЭтоЗакрытие;
	
	Элементы.ПланПогашенияЗадолженностиОбновитьСуммуОплат.Доступность = НЕ ЭтоЗакрытие;
	//
	//Элементы.ГруппаПланПогашенияЗадолженности.Видимость = НЕ ЭтоЗакрытие;
	//Элементы.ТекущиеЗадолженностиОтметка.Видимость = НЕ ЭтоЗакрытие;
	//Элементы.ТекущиеЗадолженностиДокумент.Видимость = НЕ ЭтоЗакрытие;
	
КонецПроцедуры
 
#КонецОбласти
